TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_СостоянияРегистрации/гкс_СостоянияРегистрации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_СостоянияРегистрации</name>
  <enumValues>
    <name>Прибыл</name>
  </enumValues>
  <enumValues>
    <name>ВзвешенБрутто</name>
  </enumValues>
  <enumValues>
    <name>НеПринятоПоПревышениюМаксимальногоВеса</name>
  </enumValues>
  <enumValues>
    <name>Регистрация</name>
  </enumValues>
  <enumValues>
    <name>ГотовКОтборуПроб</name>
  </enumValues>
  <enumValues>
    <name>ВзятыПробы</name>
  </enumValues>
  <enumValues>
    <name>РезультатыПробПолучены</name>
  </enumValues>
  <enumValues>
    <name>КачествоПринято</name>
  </enumValues>
  <enumValues>
    <name>КачествоНеПринято</name>
  </enumValues>
  <enumValues>
    <name>ВыгрузкаРазрешена</name>
  </enumValues>
  <enumValues>
    <name>Выгружен</name>
  </enumValues>
  <enumValues>
    <name>ВзвешенТара</name>
  </enumValues>
  <enumValues>
    <name>Убыл</name>
  </enumValues>
  <enumValues>
    <name>НеПринято</name>
  </enumValues>
  <enumValues>
    <name>ПринятыПробы</name>
  </enumValues>
  <enumValues>
    <name>ПогрузкаРазрешена</name>
    <comment>ERP-2029</comment>
  </enumValues>
  <enumValues>
    <name>Погружен</name>
    <comment>ERP-2029</comment>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_ТипРегистрации/гкс_ТипРегистрации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ТипРегистрации</name>
  <enumValues>
    <name>Приемка</name>
  </enumValues>
  <enumValues>
    <name>Отгрузка</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_ТипыТранспортныхСредствДоставки/гкс_ТипыТранспортныхСредствДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ТипыТранспортныхСредствДоставки</name>
  <enumValues>
    <name>Автомобиль</name>
  </enumValues>
  <enumValues>
    <name>Судно</name>
  </enumValues>
  <enumValues>
    <name>ЖДТранспорт</name>
  </enumValues>
  <enumValues>
    <name>Самолёт</name>
  </enumValues>
  <enumValues>
    <name>БезДоставки</name>
  </enumValues>
  <enumValues>
    <name>Трубопровод</name>
  </enumValues>
  <enumValues>
    <name>Контейнер</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/CommonModules/гкс_ПриемкаТранспортаКлиентСервер/Module.bsl
#Область ПрограммныйИнтерфейс

#Область СостоянияРегистрации

// Проверяет, соотвествует ли переданное значение состоянию Прибыл.
// 
// Параметры:
//  Состояние - ПеречислениеСсылка.гкс_СостоянияРегистрации - проверяемое значение.
// 
// Возвращаемое значение:
//  Булево - переданное значение соотвествует состоянию Прибыл
Функция СоотвествуетСостояниюПрибыл(Состояние) Экспорт
	
	СостоянияПроверки = Новый Массив;
	СостоянияПроверки.Добавить(ПредопределенноеЗначение("Перечисление.гкс_СостоянияРегистрации.Прибыл"));
	
	Возврат СостоянияПроверки.Найти(Состояние) <> Неопределено;
	
КонецФункции

// Проверяет, соотвествует ли переданное значение состоянию ГотовКОтборуПроб.
// 
// Параметры:
//  Состояние - ПеречислениеСсылка.гкс_СостоянияРегистрации - проверяемое значение.
// 
// Возвращаемое значение:
//  Булево - переданное значение соотвествует состоянию ГотовКОтборуПроб
Функция СоотвествуетСостояниюГотовКОтборуПроб(Состояние) Экспорт
	
	СостоянияПроверки = Новый Массив;
	СостоянияПроверки.Добавить(ПредопределенноеЗначение("Перечисление.гкс_СостоянияРегистрации.ГотовКОтборуПроб"));

	Возврат СостоянияПроверки.Найти(Состояние) <> Неопределено;
	
КонецФункции

// Проверяет, соотвествует ли переданное значение состоянию ВзвешенБрутто.
// 
// Параметры:
//  Состояние - ПеречислениеСсылка.гкс_СостоянияРегистрации - проверяемое значение.
// 
// Возвращаемое значение:
//  Булево - переданное значение соотвествует состоянию ВзвешенБрутто
Функция СоотвествуетСостояниюВзвешенБрутто(Состояние) Экспорт
	
	СостоянияПроверки = Новый Массив;
	СостоянияПроверки.Добавить(ПредопределенноеЗначение("Перечисление.гкс_СостоянияРегистрации.ВзвешенБрутто")); 

	Возврат СостоянияПроверки.Найти(Состояние) <> Неопределено;
	
КонецФункции

// Проверяет, соотвествует ли переданное значение состоянию ВзятыПробы.
// 
// Параметры:
//  Состояние - ПеречислениеСсылка.гкс_СостоянияРегистрации - проверяемое значение.
// 
// Возвращаемое значение:
//  Булево - переданное значение соотвествует состоянию ВзятыПробы
Функция СоотвествуетСостояниюВзятыПробы(Состояние) Экспорт
	
	СостоянияПроверки = Новый Массив;
	СостоянияПроверки.Добавить(ПредопределенноеЗначение("Перечисление.гкс_СостоянияРегистрации.ВзятыПробы"));

	Возврат СостоянияПроверки.Найти(Состояние) <> Неопределено;
	
КонецФункции

// Проверяет, соотвествует ли переданное значение состоянию ПринятыПробы.
// 
// Параметры:
//  Состояние - ПеречислениеСсылка.гкс_СостоянияРегистрации - проверяемое значение.
// 
// Возвращаемое значение:
//  Булево - переданное значение соотвествует состоянию ПринятыПробы
Функция СоотвествуетСостояниюПринятыПробы(Состояние) Экспорт
	
	СостоянияПроверки = Новый Массив;
	СостоянияПроверки.Добавить(ПредопределенноеЗначение("Перечисление.гкс_СостоянияРегистрации.ПринятыПробы"));

	Возврат СостоянияПроверки.Найти(Состояние) <> Неопределено;
	
КонецФункции

// Проверяет, соотвествует ли переданное значение состоянию РезультатыПробПолучены.
// 
// Параметры:
//  Состояние - ПеречислениеСсылка.гкс_СостоянияРегистрации - проверяемое значение.
// 
// Возвращаемое значение:
//  Булево - переданное значение соотвествует состоянию РезультатыПробПолучены
Функция СоотвествуетСостояниюРезультатыПробПолучены(Состояние) Экспорт
	
	СостоянияПроверки = Новый Массив;
	СостоянияПроверки.Добавить(
		ПредопределенноеЗначение("Перечисление.гкс_СостоянияРегистрации.РезультатыПробПолучены"));

	Возврат Не СостоянияПроверки.Найти(Состояние) = Неопределено;
	
КонецФункции

// Проверяет, соотвествует ли переданное значение состоянию КачествоНеПринято.
// 
// Параметры:
//  Состояние - ПеречислениеСсылка.гкс_СостоянияРегистрации - проверяемое значение.
// 
// Возвращаемое значение:
//  Булево - переданное значение соотвествует состоянию КачествоНеПринято
Функция СоотвествуетСостояниюКачествоНеПринято(Состояние) Экспорт
	
	СостоянияПроверки = Новый Массив;
	СостоянияПроверки.Добавить(ПредопределенноеЗначение("Перечисление.гкс_СостоянияРегистрации.КачествоНеПринято"));

	Возврат СостоянияПроверки.Найти(Состояние) <> Неопределено;
	
КонецФункции

// Проверяет, соотвествует ли переданное значение состоянию КачествоПринято.
// 
// Параметры:
//  Состояние - ПеречислениеСсылка.гкс_СостоянияРегистрации - проверяемое значение.
// 
// Возвращаемое значение:
//  Булево - переданное значение соотвествует состоянию КачествоПринято
Функция СоотвествуетСостояниюКачествоПринято(Состояние) Экспорт
	
	СостоянияПроверки = Новый Массив;
	СостоянияПроверки.Добавить(ПредопределенноеЗначение("Перечисление.гкс_СостоянияРегистрации.КачествоПринято"));

	Возврат СостоянияПроверки.Найти(Состояние) <> Неопределено;
	
КонецФункции

// Проверяет, соотвествует ли переданное значение состоянию ВыгрузкаРазрешена или ПогрузкаРазрешена.
// 
// Параметры:
//  Состояние - ПеречислениеСсылка.гкс_СостоянияРегистрации - проверяемое значение.
// 
// Возвращаемое значение:
//  Булево - переданное значение соотвествует состоянию ВыгрузкаРазрешена или ПогрузкаРазрешена
Функция СоотвествуетСостояниюВыгрузкаПогрузкаРазрешена(Состояние) Экспорт
	
	СостоянияПроверки = Новый Массив;
	СостоянияПроверки.Добавить(ПредопределенноеЗначение("Перечисление.гкс_СостоянияРегистрации.ВыгрузкаРазрешена"));
	СостоянияПроверки.Добавить(ПредопределенноеЗначение("Перечисление.гкс_СостоянияРегистрации.ПогрузкаРазрешена"));
	
	Возврат СостоянияПроверки.Найти(Состояние) <> Неопределено;
	
КонецФункции

// Проверяет, соотвествует ли переданное значение состоянию ПогрузкаРазрешена.
// 
// Параметры:
//  Состояние - ПеречислениеСсылка.гкс_СостоянияРегистрации - проверяемое значение.
// 
// Возвращаемое значение:
//  Булево - переданное значение соотвествует состоянию ПогрузкаРазрешена
Функция СоотвествуетСостояниюПогрузкаРазрешена(Состояние) Экспорт
	
	СостоянияПроверки = Новый Массив;
	СостоянияПроверки.Добавить(ПредопределенноеЗначение("Перечисление.гкс_СостоянияРегистрации.ПогрузкаРазрешена"));

	Возврат СостоянияПроверки.Найти(Состояние) <> Неопределено;
	
КонецФункции

// Проверяет, соотвествует ли переданное значение состоянию ВыгрузкаРазрешена.
// 
// Параметры:
//  Состояние - ПеречислениеСсылка.гкс_СостоянияРегистрации - проверяемое значение.
// 
// Возвращаемое значение:
//  Булево - переданное значение соотвествует состоянию ВыгрузкаРазрешена
Функция СоотвествуетСостояниюВыгрузкаРазрешена(Состояние) Экспорт
	
	СостоянияПроверки = Новый Массив;
	СостоянияПроверки.Добавить(ПредопределенноеЗначение("Перечисление.гкс_СостоянияРегистрации.ВыгрузкаРазрешена"));

	Возврат СостоянияПроверки.Найти(Состояние) <> Неопределено;
	
КонецФункции

// Проверяет, соотвествует ли переданное значение состоянию Выгружен или Погружен.
// 
// Параметры:
//  Состояние - ПеречислениеСсылка.гкс_СостоянияРегистрации - проверяемое значение.
// 
// Возвращаемое значение:
//  Булево - переданное значение соотвествует состоянию Выгружен или Погружен
Функция СоотвествуетСостояниюВыгруженПогружен(Состояние) Экспорт
	
	СостоянияПроверки = Новый Массив;
	СостоянияПроверки.Добавить(ПредопределенноеЗначение("Перечисление.гкс_СостоянияРегистрации.Выгружен"));
	СостоянияПроверки.Добавить(ПредопределенноеЗначение("Перечисление.гкс_СостоянияРегистрации.Погружен"));

	Возврат СостоянияПроверки.Найти(Состояние) <> Неопределено;
	
КонецФункции

// Проверяет, соотвествует ли переданное значение состоянию Погружен.
// 
// Параметры:
//  Состояние - ПеречислениеСсылка.гкс_СостоянияРегистрации - проверяемое значение.
// 
// Возвращаемое значение:
//  Булево - переданное значение соотвествует состоянию Погружен
Функция СоотвествуетСостояниюПогружен(Состояние) Экспорт
	
	СостоянияПроверки = Новый Массив;
	СостоянияПроверки.Добавить(ПредопределенноеЗначение("Перечисление.гкс_СостоянияРегистрации.Погружен"));

	Возврат СостоянияПроверки.Найти(Состояние) <> Неопределено;
	
КонецФункции

// Проверяет, соотвествует ли переданное значение состоянию Выгружен.
// 
// Параметры:
//  Состояние - ПеречислениеСсылка.гкс_СостоянияРегистрации - проверяемое значение.
// 
// Возвращаемое значение:
//  Булево - переданное значение соотвествует состоянию Выгружен
Функция СоотвествуетСостояниюВыгружен(Состояние) Экспорт
	
	СостоянияПроверки = Новый Массив;
	СостоянияПроверки.Добавить(ПредопределенноеЗначение("Перечисление.гкс_СостоянияРегистрации.Выгружен"));

	Возврат СостоянияПроверки.Найти(Состояние) <> Неопределено;
	
КонецФункции

// Проверяет, соотвествует ли переданное значение состоянию НеПринятоПоПревышениюМаксимальногоВеса.
// 
// Параметры:
//  Состояние - ПеречислениеСсылка.гкс_СостоянияРегистрации - проверяемое значение.
// 
// Возвращаемое значение:
//  Булево - переданное значение соотвествует состоянию НеПринятоПоПревышениюМаксимальногоВеса
Функция СоотвествуетСостояниюНеПринято(Состояние) Экспорт
	
	СостоянияПроверки = Новый Массив;
	СостоянияПроверки.Добавить(
		ПредопределенноеЗначение("Перечисление.гкс_СостоянияРегистрации.НеПринятоПоПревышениюМаксимальногоВеса"));

	Возврат СостоянияПроверки.Найти(Состояние) <> Неопределено;
	
КонецФункции

// Проверяет, соотвествует ли переданное значение состоянию ВзвешенТара или НеПринятоПоПревышениюМаксимальногоВеса.
// 
// Параметры:
//  Состояние - ПеречислениеСсылка.гкс_СостоянияРегистрации - проверяемое значение.
// 
// Возвращаемое значение:
//  Булево - переданное значение соотвествует состоянию ВзвешенТара или НеПринятоПоПревышениюМаксимальногоВеса
Функция СоотвествуетСостояниюВзвешенТара(Состояние) Экспорт
	
	СостоянияПроверки = Новый Массив;
	СостоянияПроверки.Добавить(
		ПредопределенноеЗначение("Перечисление.гкс_СостоянияРегистрации.ВзвешенТара"));
	СостоянияПроверки.Добавить(
		ПредопределенноеЗначение("Перечисление.гкс_СостоянияРегистрации.НеПринятоПоПревышениюМаксимальногоВеса"));

	Возврат СостоянияПроверки.Найти(Состояние) <> Неопределено;
	
КонецФункции

// Возвращает массив допустимых состояний регистрации для формирования номера пробы.
// Используется для проверки возможности создания документа в групповом и единичном режимах.
//
// Параметры:
//  РазрешитьВходнойКонтрольДоВзвешивания - Булево - Разрешить входной контроль до взвешивания
//  
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.гкс_СостоянияРегистрации - значения перечисления гкс_СостоянияРегистрации.
Функция ВалидныеСостоянияДляФормированияНомераПробы(РазрешитьВходнойКонтрольДоВзвешивания) Экспорт

	Состояния = Новый Массив;
	Состояния.Добавить(ПредопределенноеЗначение("Перечисление.гкс_СостоянияРегистрации.ГотовКОтборуПроб"));
	Если РазрешитьВходнойКонтрольДоВзвешивания Тогда
		Состояния.Добавить(ПредопределенноеЗначение("Перечисление.гкс_СостоянияРегистрации.Прибыл"));
	КонецЕсли;

	Возврат Состояния;

КонецФункции

// Возвращает массив допустимых состояний регистрации для группового изменения направления на разгрузку.
//
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.гкс_СостоянияРегистрации - значения перечисления гкс_СостоянияРегистрации.
Функция ВалидныеСостоянияДляГрупповоеНаправлениеНаРазгрузку() Экспорт
	
	Состояния = Новый Массив;
	Состояния.Добавить(ПредопределенноеЗначение("Перечисление.гкс_СостоянияРегистрации.КачествоПринято"));
	Состояния.Добавить(ПредопределенноеЗначение("Перечисление.гкс_СостоянияРегистрации.ВыгрузкаРазрешена"));
	Состояния.Добавить(ПредопределенноеЗначение("Перечисление.гкс_СостоянияРегистрации.РезультатыПробПолучены"));
	Возврат Состояния;
	
КонецФункции

// Возвращает массив допустимых состояний регистрации для группового подтверждения пробы.
//
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.гкс_СостоянияРегистрации - значения перечисления гкс_СостоянияРегистрации.
Функция ВалидныеСостоянияДляПодтвержденияПробы() Экспорт
	
	Состояния = Новый Массив;
	Состояния.Добавить(ПредопределенноеЗначение("Перечисление.гкс_СостоянияРегистрации.ВзятыПробы"));
	Возврат Состояния;
	
КонецФункции

// Возвращает массив допустимых состояний регистрации для пропуска контроля качества.
//
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.гкс_СостоянияРегистрации - значения перечисления гкс_СостоянияРегистрации.
Функция ВалидныеСостоянияДляПропускаКонтроляКачества() Экспорт
	
	Состояния = Новый Массив;
	Состояния.Добавить(ПредопределенноеЗначение("Перечисление.гкс_СостоянияРегистрации.ГотовКОтборуПроб"));
	Возврат Состояния;
	
КонецФункции

// Возвращает массив допустимых состояний регистрации для разгрузки.
//
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.гкс_СостоянияРегистрации - значения перечисления гкс_СостоянияРегистрации.
Функция ВалидныеСостоянияДляРазгрузки() Экспорт
	
	Состояния = Новый Массив;
	Состояния.Добавить(ПредопределенноеЗначение("Перечисление.гкс_СостоянияРегистрации.ВзвешенТара"));
	Состояния.Добавить(ПредопределенноеЗначение("Перечисление.гкс_СостоянияРегистрации.КачествоПринято"));
	Возврат Состояния;
			
КонецФункции

#КонецОбласти

// Проверяет, является ли переданный тип регистрации приемкой.
// 
// Параметры:
//  ТипРегистрации - ПеречислениеСсылка.гкс_ТипРегистрации - проверяемое значение.
// 
// Возвращаемое значение:
//  Булево - Истина, если это приемка транспорта.
Функция ЭтоПриемкаТранспорта(ТипРегистрации) Экспорт
	Возврат ТипРегистрации = ПредопределенноеЗначение("Перечисление.гкс_ТипРегистрации.Приемка");
КонецФункции

// Проверяет, является ли переданный тип регистрации отгрузкой.
// 
// Параметры:
//  ТипРегистрации - ПеречислениеСсылка.гкс_ТипРегистрации - проверяемое значение.
// 
// Возвращаемое значение:
//  Булево - Истина, если это отгрузка транспорта.
Функция ЭтоОтгрузкаТранспорта(ТипРегистрации) Экспорт
	Возврат ТипРегистрации = ПредопределенноеЗначение("Перечисление.гкс_ТипРегистрации.Отгрузка");
КонецФункции

// Проверяет, является ли переданный вид перевозки железнодорожной перевозкой.
// 
// Параметры:
//  ВидПеревозки - ПеречислениеСсылка.гкс_ТипыТранспортныхСредствДоставки - проверяемое значение.
// 
// Возвращаемое значение:
//  Булево - Истина, если это ЖД перевозка.
Функция ЭтоЖДПеревозка(ВидПеревозки) Экспорт
	Возврат ВидПеревозки = ПредопределенноеЗначение("Перечисление.гкс_ТипыТранспортныхСредствДоставки.ЖДТранспорт");
КонецФункции

// Проверяет, является ли переданный вид перевозки автомобильной перевозкой.
// 
// Параметры:
//  ВидПеревозки - ПеречислениеСсылка.гкс_ТипыТранспортныхСредствДоставки - проверяемое значение.
// 
// Возвращаемое значение:
//  Булево - Истина, если это авто перевозка.
Функция ЭтоАвтоПеревозка(ВидПеревозки) Экспорт
	Возврат ВидПеревозки = ПредопределенноеЗначение("Перечисление.гкс_ТипыТранспортныхСредствДоставки.Автомобиль");
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ДополнительныеПараметрыДляПробыПриняты(ДокументРегистрации) Экспорт
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ДокументРегистрации"	, ДокументРегистрации); 
	ДополнительныеПараметры.Вставить("УИД"					, Строка(Новый УникальныйИдентификатор()));
	ДополнительныеПараметры.Вставить(
		"Состояние", ПредопределенноеЗначение("Перечисление.гкс_СостоянияРегистрации.ПринятыПробы"));
	
	Возврат ДополнительныеПараметры;
	
КонецФункции

Функция ИмяМенеджераПечатиЛабораторногоАнализа() Экспорт
	Возврат "Обработка.гкс_ПечатьДокументаЛабораторныйАнализ";
КонецФункции

Функция ТекстОшибкиНеЗаполненЛабораторныйАнализ() Экспорт
	Возврат НСтр("ru = 'Не заполнен лабораторный анализ'");
КонецФункции

#КонецОбласти
